zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70100.atdf
        <module name="RTC" id="6056" version="ZB">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1860"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <signals>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="RTT" id="6081" version="M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1830"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI" id="6088" version="ZM">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PD20" function="B" group="SPI0_MISO"/>
              <signal pad="PD21" function="B" group="SPI0_MOSI"/>
              <signal pad="PB2" function="D" group="SPI0_NPCS" index="0"/>
              <signal pad="PA31" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PD25" function="B" group="SPI0_NPCS" index="1"/>
              <signal pad="PD12" function="C" group="SPI0_NPCS" index="2"/>
              <signal pad="PD27" function="B" group="SPI0_NPCS" index="3"/>
              <signal pad="PD22" function="B" group="SPI0_SPCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="2"/>
              <param name="DMAC_ID_TX" value="1"/>
              <param name="INSTANCE_ID" value="21"/>
              <param name="CLOCK_ID" value="21"/>
            </parameters>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0x40058000"/>
            <signals>
              <signal pad="PC26" function="C" group="SPI1_MISO"/>
              <signal pad="PC27" function="C" group="SPI1_MOSI"/>
              <signal pad="PC25" function="C" group="SPI1_NPCS" index="0"/>
              <signal pad="PC28" function="C" group="SPI1_NPCS" index="1"/>
              <signal pad="PD0" function="C" group="SPI1_NPCS" index="1"/>
              <signal pad="PC29" function="C" group="SPI1_NPCS" index="2"/>
              <signal pad="PD1" function="C" group="SPI1_NPCS" index="2"/>
              <signal pad="PC30" function="C" group="SPI1_NPCS" index="3"/>
              <signal pad="PD2" function="C" group="SPI1_NPCS" index="3"/>
              <signal pad="PC24" function="C" group="SPI1_SPCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="3"/>
              <param name="INSTANCE_ID" value="42"/>
              <param name="CLOCK_ID" value="42"/>
            </parameters>
          </instance>
        </module>
        <module name="SSC" id="6078" version="Q">
          <instance name="SSC">
            <register-group address-space="base" name="SSC" name-in-module="SSC" offset="0x40004000"/>
            <signals>
              <signal pad="PA10" function="C" group="RD"/>
              <signal pad="PD24" function="B" group="RF"/>
              <signal pad="PA22" function="A" group="RK"/>
              <signal pad="PB5" function="D" group="TD"/>
              <signal pad="PD10" function="C" group="TD"/>
              <signal pad="PD26" function="B" group="TD"/>
              <signal pad="PB0" function="D" group="TF"/>
              <signal pad="PB1" function="D" group="TK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="33"/>
              <param name="DMAC_ID_TX" value="32"/>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="6452" version="ZE">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1810"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZL">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x4000C000"/>
            <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="40"/>
              <param name="INSTANCE_ID_CHANNEL0" value="23"/>
              <param name="INSTANCE_ID_CHANNEL1" value="24"/>
              <param name="INSTANCE_ID_CHANNEL2" value="25"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PC25" function="B" group="TCLK" index="3"/>
              <signal pad="PC28" function="B" group="TCLK" index="4"/>
              <signal pad="PC31" function="B" group="TCLK" index="5"/>
              <signal pad="PC23" function="B" group="TIOA" index="3"/>
              <signal pad="PC26" function="B" group="TIOA" index="4"/>
              <signal pad="PC29" function="B" group="TIOA" index="5"/>
              <signal pad="PC24" function="B" group="TIOB" index="3"/>
              <signal pad="PC27" function="B" group="TIOB" index="4"/>
              <signal pad="PC30" function="B" group="TIOB" index="5"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="41"/>
              <param name="INSTANCE_ID_CHANNEL0" value="26"/>
              <param name="INSTANCE_ID_CHANNEL1" value="27"/>
              <param name="INSTANCE_ID_CHANNEL2" value="28"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40014000"/>
            <signals>
              <signal pad="PC7" function="B" group="TCLK" index="6"/>
              <signal pad="PC10" function="B" group="TCLK" index="7"/>
              <signal pad="PC14" function="B" group="TCLK" index="8"/>
              <signal pad="PC5" function="B" group="TIOA" index="6"/>
              <signal pad="PC8" function="B" group="TIOA" index="7"/>
              <signal pad="PC11" function="B" group="TIOA" index="8"/>
              <signal pad="PC6" function="B" group="TIOB" index="6"/>
              <signal pad="PC9" function="B" group="TIOB" index="7"/>
              <signal pad="PC12" function="B" group="TIOB" index="8"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="42"/>
              <param name="INSTANCE_ID_CHANNEL0" value="47"/>
              <param name="INSTANCE_ID_CHANNEL1" value="48"/>
              <param name="INSTANCE_ID_CHANNEL2" value="49"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group address-space="base" name="TC3" name-in-module="TC" offset="0x40054000"/>
            <signals>
              <signal pad="PE2" function="B" group="TCLK" index="9"/>
              <signal pad="PE5" function="B" group="TCLK" index="10"/>
              <signal pad="PD24" function="C" group="TCLK" index="11"/>
              <signal pad="PE0" function="B" group="TIOA" index="9"/>
              <signal pad="PE3" function="B" group="TIOA" index="10"/>
              <signal pad="PD21" function="C" group="TIOA" index="11"/>
              <signal pad="PE1" function="B" group="TIOB" index="9"/>
              <signal pad="PE4" function="B" group="TIOB" index="10"/>
              <signal pad="PD22" function="C" group="TIOB" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="43"/>
              <param name="INSTANCE_ID_CHANNEL0" value="50"/>
              <param name="INSTANCE_ID_CHANNEL1" value="51"/>
              <param name="INSTANCE_ID_CHANNEL2" value="52"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="6334" version="G">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x40070000"/>
            <parameters>
              <param name="INSTANCE_ID" value="57"/>
              <param name="CLOCK_ID" value="57"/>
            </parameters>
          </instance>
        </module>
        <module name="TWI" id="11210" version="Z">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="15"/>
              <param name="DMAC_ID_TX" value="14"/>
              <param name="INSTANCE_ID" value="19"/>
              <param name="CLOCK_ID" value="19"/>
            </parameters>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB5" function="A" group="TWCK" index="1"/>
              <signal pad="PB4" function="A" group="TWD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="17"/>
              <param name="DMAC_ID_TX" value="16"/>
              <param name="INSTANCE_ID" value="20"/>
              <param name="CLOCK_ID" value="20"/>
            </parameters>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0x40060000"/>
            <signals>
              <signal pad="PD28" function="C" group="TWCK" index="2"/>
              <signal pad="PD27" function="C" group="TWD" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="19"/>
              <param name="DMAC_ID_TX" value="18"/>
              <param name="INSTANCE_ID" value="41"/>
              <param name="CLOCK_ID" value="41"/>
            </parameters>
          </instance>
        </module>
