zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70100.atdf
      <value-group caption="" name="MCAN_TEST__LBCK">
        <value caption="Reset value. Loop Back mode is disabled." name="DISABLED" value="0"/>
        <value caption="Loop Back mode is enabled (see Section 6.1.9)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_TEST__TX">
        <value caption="Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time." name="RESET" value="0x0"/>
        <value caption="Sample Point can be monitored at pin CANTX." name="SAMPLE_POINT_MONITORING" value="0x1"/>
        <value caption="Dominant ('0') level at pin CANTX." name="DOMINANT" value="0x2"/>
        <value caption="Recessive ('1') at pin CANTX." name="RECESSIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__INIT">
        <value caption="Normal operation." name="DISABLED" value="0"/>
        <value caption="Initialization is started." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__CCE">
        <value caption="The processor has no write access to the protected configuration registers." name="PROTECTED" value="0"/>
        <value caption="The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1')." name="CONFIGURABLE" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__ASM">
        <value caption="Normal CAN operation." name="NORMAL" value="0"/>
        <value caption="Restricted Operation mode active." name="RESTRICTED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__CSR">
        <value caption="No clock stop is requested." name="NO_CLOCK_STOP" value="0"/>
        <value caption="Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle." name="CLOCK_STOP" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__MON">
        <value caption="Bus Monitoring mode is disabled." name="DISABLED" value="0"/>
        <value caption="Bus Monitoring mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__DAR">
        <value caption="Automatic retransmission of messages not transmitted successfully enabled." name="AUTO_RETX" value="0"/>
        <value caption="Automatic retransmission disabled." name="NO_AUTO_RETX" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__TEST">
        <value caption="Normal operation, MCAN_TEST register holds reset values." name="DISABLED" value="0"/>
        <value caption="Test mode, write access to MCAN_TEST register enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__FDOE">
        <value caption="FD operation disabled." name="DISABLED" value="0"/>
        <value caption="FD operation enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__BRSE">
        <value caption="Bit rate switching for transmissions disabled." name="DISABLED" value="0"/>
        <value caption="Bit rate switching for transmissions enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_TSCC__TSS">
        <value caption="Timestamp counter value always 0x0000" name="ALWAYS_0" value="0x0"/>
        <value caption="Timestamp counter value incremented according to TCP" name="TCP_INC" value="0x1"/>
        <value caption="External timestamp counter value used" name="EXT_TIMESTAMP" value="0x2"/>
      </value-group>
      <value-group caption="" name="MCAN_TOCC__ETOC">
        <value caption="Timeout Counter disabled." name="NO_TIMEOUT" value="0"/>
        <value caption="Timeout Counter enabled." name="TOS_CONTROLLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_TOCC__TOS">
        <value caption="Continuous operation" name="CONTINUOUS" value="0x0"/>
        <value caption="Timeout controlled by Tx Event FIFO" name="TX_EV_TIMEOUT" value="0x1"/>
        <value caption="Timeout controlled by Receive FIFO 0" name="RX0_EV_TIMEOUT" value="0x2"/>
        <value caption="Timeout controlled by Receive FIFO 1" name="RX1_EV_TIMEOUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_PSR__LEC">
        <value caption="No error occurred since LEC has been reset by successful reception or transmission." name="NO_ERROR" value="0x0"/>
        <value caption="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." name="STUFF_ERROR" value="0x1"/>
        <value caption="A fixed format part of a received frame has the wrong format." name="FORM_ERROR" value="0x2"/>
        <value caption="The message transmitted by the MCAN was not acknowledged by another node." name="ACK_ERROR" value="0x3"/>
        <value caption="During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." name="BIT1_ERROR" value="0x4"/>
        <value caption="During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." name="BIT0_ERROR" value="0x5"/>
        <value caption="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data." name="CRC_ERROR" value="0x6"/>
        <value caption="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." name="NO_CHANGE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_PSR__ACT">
        <value caption="Node is synchronizing on CAN communication" name="SYNCHRONIZING" value="0x0"/>
        <value caption="Node is neither receiver nor transmitter" name="IDLE" value="0x1"/>
        <value caption="Node is operating as receiver" name="RECEIVER" value="0x2"/>
        <value caption="Node is operating as transmitter" name="TRANSMITTER" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__RRFE">
        <value caption="Filter remote frames with 29-bit extended IDs." name="FILTER" value="0"/>
        <value caption="Reject all remote frames with 29-bit extended IDs." name="REJECT" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__RRFS">
        <value caption="Filter remote frames with 11-bit standard IDs." name="FILTER" value="0"/>
        <value caption="Reject all remote frames with 11-bit standard IDs." name="REJECT" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__ANFE">
        <value caption="Accept in Rx FIFO 0" name="RX_FIFO_0" value="0"/>
        <value caption="Accept in Rx FIFO 1" name="RX_FIFO_1" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__ANFS">
        <value caption="Accept in Rx FIFO 0" name="RX_FIFO_0" value="0"/>
        <value caption="Accept in Rx FIFO 1" name="RX_FIFO_1" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_HPMS__MSI">
        <value caption="No FIFO selected." name="NO_FIFO_SEL" value="0x0"/>
        <value caption="FIFO message lost." name="LOST" value="0x1"/>
        <value caption="Message stored in FIFO 0." name="FIFO_0" value="0x2"/>
        <value caption="Message stored in FIFO 1." name="FIFO_1" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_RXF1S__DMS">
        <value caption="Idle state, wait for reception of debug messages, DMA request is cleared." name="IDLE" value="0x0"/>
        <value caption="Debug message A received." name="MSG_A" value="0x1"/>
        <value caption="Debug messages A, B received." name="MSG_AB" value="0x2"/>
        <value caption="Debug messages A, B, C received, DMA request is set." name="MSG_ABC" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_RXESC__F0DS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_RXESC__F1DS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_RXESC__RBDS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_TXESC__TBDS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48- byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
    </module>
    <module name="MLB" caption="MediaLB" id="11287" version="E">
      <register-group name="MLB">
        <register caption="MediaLB Control 0 Register" name="MLB_MLBC0" offset="0x000" rw="RW" size="4">
          <bitfield caption="MediaLB Enable" mask="0x00000001" name="MLBEN"/>
          <bitfield caption="MLBCLK (MediaLB clock) Speed Select" mask="0x0000001C" name="MLBCLK" values="MLB_MLBC0__MLBCLK"/>
          <bitfield caption="Must be Written to 0" mask="0x00000020" name="ZERO"/>
          <bitfield caption="MediaLB Lock Status (read-only)" mask="0x00000080" name="MLBLK"/>
          <bitfield caption="Asynchronous Tx Packet Retry" mask="0x00001000" name="ASYRETRY"/>
          <bitfield caption="Control Tx Packet Retry" mask="0x00004000" name="CTLRETRY"/>
          <bitfield caption="The number of frames per sub-buffer for synchronous channels" mask="0x00038000" name="FCNT" values="MLB_MLBC0__FCNT"/>
        </register>
        <register caption="MediaLB Channel Status 0 Register" name="MLB_MS0" offset="0x00C" rw="RW" size="4">
          <bitfield caption="MediaLB Channel Status [31:0] (cleared by writing a 0)" mask="0xFFFFFFFF" name="MCS"/>
        </register>
        <register caption="MediaLB Channel Status1 Register" name="MLB_MS1" offset="0x014" rw="RW" size="4">
          <bitfield caption="MediaLB Channel Status [63:32] (cleared by writing a 0)" mask="0xFFFFFFFF" name="MCS"/>
        </register>
        <register caption="MediaLB System Status Register" name="MLB_MSS" offset="0x020" rw="RW" size="4">
          <bitfield caption="Reset System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000001" name="RSTSYSCMD"/>
          <bitfield caption="Network Lock System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000002" name="LKSYSCMD"/>
          <bitfield caption="Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000004" name="ULKSYSCMD"/>
          <bitfield caption="Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000008" name="CSSYSCMD"/>
          <bitfield caption="Software System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000010" name="SWSYSCMD"/>
          <bitfield caption="Service Request Enabled" mask="0x00000020" name="SERVREQ"/>
        </register>
        <register caption="MediaLB System Data Register" name="MLB_MSD" offset="0x024" rw="R" size="4">
          <bitfield caption="System Data (Byte 0)" mask="0x000000FF" name="SD0"/>
          <bitfield caption="System Data (Byte 1)" mask="0x0000FF00" name="SD1"/>
          <bitfield caption="System Data (Byte 2)" mask="0x00FF0000" name="SD2"/>
          <bitfield caption="System Data (Byte 3)" mask="0xFF000000" name="SD3"/>
        </register>
        <register caption="MediaLB Interrupt Enable Register" name="MLB_MIEN" offset="0x02C" rw="RW" size="4">
          <bitfield caption="Isochronous Rx Protocol Error Enable" mask="0x00000001" name="ISOC_PE"/>
          <bitfield caption="Isochronous Rx Buffer Overflow Enable" mask="0x00000002" name="ISOC_BUFO"/>
          <bitfield caption="Synchronous Protocol Error Enable" mask="0x00010000" name="SYNC_PE"/>
          <bitfield caption="Asynchronous Rx Done Enable" mask="0x00020000" name="ARX_DONE"/>
          <bitfield caption="Asynchronous Rx Protocol Error Enable" mask="0x00040000" name="ARX_PE"/>
          <bitfield caption="Asynchronous Rx Break Enable" mask="0x00080000" name="ARX_BREAK"/>
          <bitfield caption="Asynchronous Tx Packet Done Enable" mask="0x00100000" name="ATX_DONE"/>
          <bitfield caption="Asynchronous Tx Protocol Error Enable" mask="0x00200000" name="ATX_PE"/>
          <bitfield caption="Asynchronous Tx Break Enable" mask="0x00400000" name="ATX_BREAK"/>
          <bitfield caption="Control Rx Packet Done Enable" mask="0x01000000" name="CRX_DONE"/>
          <bitfield caption="Control Rx Protocol Error Enable" mask="0x02000000" name="CRX_PE"/>
          <bitfield caption="Control Rx Break Enable" mask="0x04000000" name="CRX_BREAK"/>
          <bitfield caption="Control Tx Packet Done Enable" mask="0x08000000" name="CTX_DONE"/>
          <bitfield caption="Control Tx Protocol Error Enable" mask="0x10000000" name="CTX_PE"/>
          <bitfield caption="Control Tx Break Enable" mask="0x20000000" name="CTX_BREAK"/>
        </register>
        <register caption="MediaLB Control 1 Register" name="MLB_MLBC1" offset="0x03C" rw="RW" size="4">
          <bitfield caption="MediaLB Lock Error Status (cleared by writing a 0)" mask="0x00000040" name="LOCK"/>
          <bitfield caption="MediaLB Clock Missing Status (cleared by writing a 0)" mask="0x00000080" name="CLKM"/>
          <bitfield caption="Node Device Address" mask="0x0000FF00" name="NDA"/>
        </register>
        <register caption="HBI Control Register" name="MLB_HCTL" offset="0x080" rw="RW" size="4">
          <bitfield caption="Address Generation Unit 0 Software Reset" mask="0x00000001" name="RST0"/>
          <bitfield caption="Address Generation Unit 1 Software Reset" mask="0x00000002" name="RST1"/>
          <bitfield caption="HBI Enable" mask="0x00008000" name="EN"/>
        </register>
        <register caption="HBI Channel Mask 0 Register 0" name="MLB_HCMR" offset="0x88" rw="RW" size="4" count="2">
          <bitfield caption="Bitwise Channel Mask Bit [31:0]" mask="0xFFFFFFFF" name="CHM"/>
        </register>
        <register caption="HBI Channel Error 0 Register 0" name="MLB_HCER" offset="0x90" rw="R" size="4" count="2">
          <bitfield caption="Bitwise Channel Error Bit [31:0]" mask="0xFFFFFFFF" name="CERR"/>
        </register>
        <register caption="HBI Channel Busy 0 Register 0" name="MLB_HCBR" offset="0x98" rw="R" size="4" count="2">
          <bitfield caption="Bitwise Channel Busy Bit [31:0]" mask="0xFFFFFFFF" name="CHB"/>
        </register>
        <register caption="MIF Data 0 Register 0" name="MLB_MDAT" offset="0xC0" rw="RW" size="4" count="4">
          <bitfield caption="CRT or DBR Data" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="MIF Data Write Enable 0 Register 0" name="MLB_MDWE" offset="0xD0" rw="RW" size="4" count="4">
          <bitfield caption="Bitwise Write Enable for CTR Data - bits[31:0]" mask="0xFFFFFFFF" name="MASK"/>
        </register>
        <register caption="MIF Control Register" name="MLB_MCTL" offset="0x0E0" rw="RW" size="4">
          <bitfield caption="Transfer Complete (Write 0 to Clear)" mask="0x00000001" name="XCMP"/>
        </register>
