zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70100.atdf
        <register caption="PWMC Channel Dead Time Update Register (ch_num = 0)" name="PWMC_DTUPD" offset="0x1C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
      </register-group>
      <register-group name="PWMC_CMP" size="16">
        <register caption="PWMC Comparison 0 Value Register" name="PWMC_CMPV" offset="0x00" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWMC Comparison 0 Value Update Register" name="PWMC_CMPVUPD" offset="0x04" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWMC Comparison 0 Mode Register" name="PWMC_CMPM" offset="0x08" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWMC Comparison 0 Mode Update Register" name="PWMC_CMPMUPD" offset="0x0C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
      </register-group>
      <register-group name="PWMC">
        <register caption="PWMC Clock Register" name="PWMC_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA Divide Factor" mask="0x000000FF" name="DIVA" values="PWMC_CLK__DIVA"/>
          <bitfield caption="CLKA Source Clock Selection" mask="0x00000F00" name="PREA" values="PWMC_CLK__PREA"/>
          <bitfield caption="CLKB Divide Factor" mask="0x00FF0000" name="DIVB" values="PWMC_CLK__DIVB"/>
          <bitfield caption="CLKB Source Clock Selection" mask="0x0F000000" name="PREB" values="PWMC_CLK__PREB"/>
        </register>
        <register caption="PWMC Enable Register" name="PWMC_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWMC Disable Register" name="PWMC_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWMC Status Register" name="PWMC_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWMC Interrupt Enable Register 1" name="PWMC_IER1" offset="0x10" rw="W" size="4" atomic-op="set:PWMC_IMR1">
          <bitfield caption="Counter Event on Channel 0 Interrupt Enable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Enable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Enable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Enable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Enable" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWMC Interrupt Disable Register 1" name="PWMC_IDR1" offset="0x14" rw="W" size="4" atomic-op="clear:PWMC_IMR1">
          <bitfield caption="Counter Event on Channel 0 Interrupt Disable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Disable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Disable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Disable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Disable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Disable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Disable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Disable" mask="0x00080000" name="FCHID3"/>
        </register>
