zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70100.atdf
        <register caption="PWMC Spread Spectrum Register" name="PWMC_SSPR" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Spread Spectrum Limit Value" mask="0x00FFFFFF" name="SPRD"/>
          <bitfield caption="Spread Spectrum Counter Mode" mask="0x01000000" name="SPRDM"/>
        </register>
        <register caption="PWMC Spread Spectrum Update Register" name="PWMC_SSPUP" offset="0xA4" rw="W" size="4">
          <bitfield caption="Spread Spectrum Limit Value Update" mask="0x00FFFFFF" name="SPRDUP"/>
        </register>
        <register caption="PWMC Stepper Motor Mode Register" name="PWMC_SMMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Gray Count ENable" mask="0x00000001" name="GCEN0"/>
          <bitfield caption="Gray Count ENable" mask="0x00000002" name="GCEN1"/>
          <bitfield caption="DOWN Count" mask="0x00010000" name="DOWN0"/>
          <bitfield caption="DOWN Count" mask="0x00020000" name="DOWN1"/>
        </register>
        <register caption="PWMC Fault Protection Value 2 Register" name="PWMC_FPV2" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 0" mask="0x00000001" name="FPZH0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 1" mask="0x00000002" name="FPZH1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 2" mask="0x00000004" name="FPZH2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 3" mask="0x00000008" name="FPZH3"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 0" mask="0x00010000" name="FPZL0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 1" mask="0x00020000" name="FPZL1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 2" mask="0x00040000" name="FPZL2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 3" mask="0x00080000" name="FPZL3"/>
        </register>
        <register caption="PWMC Write Protection Control Register" name="PWMC_WPCR" offset="0xE4" rw="W" size="4">
          <bitfield caption="Write Protection Command" mask="0x00000003" name="WPCMD" values="PWMC_WPCR__WPCMD"/>
          <bitfield caption="Write Protection Register Group 0" mask="0x00000004" name="WPRG0"/>
          <bitfield caption="Write Protection Register Group 1" mask="0x00000008" name="WPRG1"/>
          <bitfield caption="Write Protection Register Group 2" mask="0x00000010" name="WPRG2"/>
          <bitfield caption="Write Protection Register Group 3" mask="0x00000020" name="WPRG3"/>
          <bitfield caption="Write Protection Register Group 4" mask="0x00000040" name="WPRG4"/>
          <bitfield caption="Write Protection Register Group 5" mask="0x00000080" name="WPRG5"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PWMC_WPCR__WPKEY"/>
        </register>
        <register caption="PWMC Write Protection Status Register" name="PWM_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect SW Status" mask="0x00000001" name="WPSWS0"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000002" name="WPSWS1"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000004" name="WPSWS2"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000008" name="WPSWS3"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000010" name="WPSWS4"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000020" name="WPSWS5"/>
          <bitfield caption="Write Protect Violation Status" mask="0x00000080" name="WPVS"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000100" name="WPHWS0"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000200" name="WPHWS1"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000400" name="WPHWS2"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000800" name="WPHWS3"/>
          <bitfield caption="Write Protect HW Status" mask="0x00001000" name="WPHWS4"/>
          <bitfield caption="Write Protect HW Status" mask="0x00002000" name="WPHWS5"/>
          <bitfield caption="Write Protect Violation Source" mask="0xFFFF0000" name="WPVSRC"/>
        </register>
        <register-group caption="PWMC Comparison 0 Value Register" offset="0x130" name="PWMC_CMP" size="16" count="8" name-in-module="PWMC_CMP"/>
        <register-group caption="PWMC Channel Mode Register (ch_num = 0)" offset="0x200" name="PWMC_CH_NUM" count="4" size="32" name-in-module="PWMC_CH_NUM"/>
        <register caption="PWMC Channel Mode Update Register (ch_num = 0)" name="PWMC_CMUPD0" offset="0x400" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWMC Channel Mode Update Register (ch_num = 1)" name="PWMC_CMUPD1" offset="0x420" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWMC External Trigger Register (trg_num = 1)" name="PWMC_ETRG1" offset="0x42C" rw="RW" size="4">
          <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
          <bitfield caption="External Trigger Mode" mask="0x03000000" name="TRGMODE" values="PWMC_ETRG1__TRGMODE"/>
          <bitfield caption="Edge Selection" mask="0x10000000" name="TRGEDGE" values="PWMC_ETRG1__TRGEDGE"/>
          <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
          <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
          <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
        </register>
        <register caption="PWMC Leading-Edge Blanking Register (trg_num = 1)" name="PWMC_LEBR1" offset="0x430" rw="RW" size="4">
          <bitfield caption="Leading-Edge Blanking Delay for TRGINx" mask="0x0000007F" name="LEBDELAY"/>
          <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
          <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
          <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
          <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
        </register>
        <register caption="PWMC Channel Mode Update Register (ch_num = 2)" name="PWMC_CMUPD2" offset="0x440" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWMC External Trigger Register (trg_num = 2)" name="PWMC_ETRG2" offset="0x44C" rw="RW" size="4">
          <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
          <bitfield caption="External Trigger Mode" mask="0x03000000" name="TRGMODE" values="PWMC_ETRG2__TRGMODE"/>
          <bitfield caption="Edge Selection" mask="0x10000000" name="TRGEDGE" values="PWMC_ETRG2__TRGEDGE"/>
          <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
          <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
          <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
        </register>
