zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70100.atdf
        <register caption="Transmit Holding Register" name="TWI_THR" offset="0x34" rw="W" size="4">
          <bitfield caption="Master or Slave Transmit Holding Data" mask="0x000000FF" name="TXDATA"/>
        </register>
        <register caption="SMBus Timing Register" name="TWI_SMBTR" offset="0x38" rw="RW" size="4">
          <bitfield caption="SMBus Clock Prescaler" mask="0x0000000F" name="PRESC"/>
          <bitfield caption="Slave Clock Stretch Maximum Cycles" mask="0x0000FF00" name="TLOWS"/>
          <bitfield caption="Master Clock Stretch Maximum Cycles" mask="0x00FF0000" name="TLOWM"/>
          <bitfield caption="Clock High Maximum Cycles" mask="0xFF000000" name="THMAX"/>
        </register>
        <register caption="Filter Register" name="TWI_FILTR" offset="0x44" rw="RW" size="4">
          <bitfield caption="RX Digital Filter" mask="0x00000001" name="FILT"/>
          <bitfield caption="PAD Filter Enable" mask="0x00000002" name="PADFEN"/>
          <bitfield caption="PAD Filter Config" mask="0x00000004" name="PADFCFG"/>
          <bitfield caption="Digital Filter Threshold" mask="0x00000700" name="THRES"/>
        </register>
        <register caption="SleepWalking Matching Register" name="TWI_SWMR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Slave Address 1" mask="0x0000007F" name="SADR1"/>
          <bitfield caption="Slave Address 2" mask="0x00007F00" name="SADR2"/>
          <bitfield caption="Slave Address 3" mask="0x007F0000" name="SADR3"/>
          <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
        </register>
        <register caption="Debug Register" name="TWI_DR" offset="0xD0" rw="R" size="4">
          <bitfield caption="SleepWalking Enable" mask="0x00000001" name="SWEN"/>
          <bitfield caption="Clock Request" mask="0x00000002" name="CLKRQ"/>
          <bitfield caption="SleepWalking Match" mask="0x00000004" name="SWMATCH"/>
          <bitfield caption="Transfer Pending" mask="0x00000008" name="TRP"/>
        </register>
        <register caption="Write Protection Mode Register" name="TWI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TWI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="TWI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="TWI_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="_1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="_2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="_3_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TWI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
    </module>
    <module name="UART" caption="Universal Asynchronous Receiver Transmitter" id="6418" version="R">
      <register-group name="UART">
        <register caption="Control Register" name="UART_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Request Clear" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Debug Enable" mask="0x00008000" name="DBGE"/>
        </register>
        <register caption="Mode Register" name="UART_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Receiver Digital Filter" mask="0x00000010" name="FILTER" values="UART_MR__FILTER"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="UART_MR__PAR"/>
          <bitfield caption="Baud Rate Source Clock" mask="0x00001000" name="BRSRCCK" values="UART_MR__BRSRCCK"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="UART_MR__CHMODE"/>
        </register>
        <register caption="Interrupt Enable Register" name="UART_IER" offset="0x0008" rw="W" size="4" atomic-op="set:UART_IMR">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Enable Comparison Interrupt" mask="0x00008000" name="CMP"/>
        </register>
        <register caption="Interrupt Disable Register" name="UART_IDR" offset="0x000C" rw="W" size="4" atomic-op="clear:UART_IMR">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Disable Comparison Interrupt" mask="0x00008000" name="CMP"/>
        </register>
        <register caption="Interrupt Mask Register" name="UART_IMR" offset="0x0010" rw="R" size="4" atomic-op="read:UART_IMR">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask Comparison Interrupt" mask="0x00008000" name="CMP"/>
        </register>
        <register caption="Status Register" name="UART_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Comparison Match" mask="0x00008000" name="CMP"/>
          <bitfield caption="SleepWalking Enable Status" mask="0x00200000" name="SWES"/>
          <bitfield caption="Clock Request" mask="0x00400000" name="CLKREQ"/>
          <bitfield caption="Wake-Up Request" mask="0x00800000" name="WKUPREQ"/>
        </register>
