zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70100.atdf
        <register caption="Host Pipe Disable Register" name="USBHS_HSTPIPIDR" offset="0x620" rw="W" size="4" count="10" atomic-op="clear:USBHS_HSTPIPIMR">
          <mode name="CTRL_BULK_INT" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Control, Interrupt and Bulk Endpoints"/>
          <mode name="INT_ISO" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Interrupt and Isochronous Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_HSTPIPCFG.PTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield modes="INT_ISO" caption="Underflow Interrupt Disable" mask="0x00000004" name="UNDERFIEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield modes="CTRL_BULK_INT" caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Disable" mask="0x00000040" name="CRCERREC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe IN Request Register" name="USBHS_HSTPIPINRQ" offset="0x650" rw="RW" size="4" count="10">
          <bitfield caption="IN Request Number before Freeze" mask="0x000000FF" name="INRQ"/>
          <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
        </register>
        <register caption="Host Pipe Error Register" name="USBHS_HSTPIPERR" offset="0x680" rw="RW" size="4" count="10">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register-group caption="Host DMA Channel Next Descriptor Address Register (n = 1)" offset="0x710" name="USBHS_HSTDMA" size="16" count="7" name-in-module="USBHS_HSTDMA"/>
        <register caption="General Control Register" name="USBHS_CTRL" offset="0x0800" rw="RW" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt Enable" mask="0x00000010" name="RDERRE"/>
          <bitfield caption="VBUS Hardware Control" mask="0x00000100" name="VBUSHWC"/>
          <bitfield caption="Freeze USB Clock" mask="0x00004000" name="FRZCLK"/>
          <bitfield caption="USBHS Enable" mask="0x00008000" name="USBE"/>
          <bitfield caption="UID Pin Enable" mask="0x01000000" name="UID"/>
          <bitfield caption="USBHS Mode" mask="0x02000000" name="UIMOD" values="USBHS_CTRL__UIMOD"/>
        </register>
        <register caption="General Status Register" name="USBHS_SR" offset="0x0804" rw="R" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt (Host mode only)" mask="0x00000010" name="RDERRI"/>
          <bitfield caption="Speed Status (Device mode only)" mask="0x00003000" name="SPEED" values="USBHS_SR__SPEED"/>
          <bitfield caption="UTMI Clock Usable" mask="0x00004000" name="CLKUSABLE"/>
        </register>
        <register caption="General Status Clear Register" name="USBHS_SCR" offset="0x0808" rw="W" size="4" atomic-op="clear:USBHS_SR">
          <bitfield caption="Remote Device Connection Error Interrupt Clear" mask="0x00000010" name="RDERRIC"/>
        </register>
        <register caption="General Status Set Register" name="USBHS_SFR" offset="0x080C" rw="W" size="4" atomic-op="set:USBHS_SR">
          <bitfield caption="Remote Device Connection Error Interrupt Set" mask="0x00000010" name="RDERRIS"/>
          <bitfield caption="VBUS Request Set" mask="0x00000200" name="VBUSRQS"/>
        </register>
        <register caption="General Test A1 Register" name="USBHS_TSTA1" offset="0x0810" rw="RW" size="4">
          <bitfield caption="Counter A" mask="0x00007FFF" name="CounterA"/>
          <bitfield caption="Load CounterA" mask="0x00008000" name="LoadCntA"/>
          <bitfield caption="Counter B" mask="0x003F0000" name="CounterB"/>
          <bitfield caption="Load CounterB" mask="0x00800000" name="LoadCntB"/>
          <bitfield caption="SOF Counter Max" mask="0x7F000000" name="SOFCntMa1"/>
          <bitfield caption="Load SOF Counter" mask="0x80000000" name="LoadSOFCnt"/>
        </register>
        <register caption="General Test A2 Register" name="USBHS_TSTA2" offset="0x0814" rw="RW" size="4">
          <bitfield caption="Full Detach Enable" mask="0x00000001" name="FullDetachEn"/>
          <bitfield caption="HS Serial Mode" mask="0x00000002" name="HSSerialMode"/>
          <bitfield caption="Loop-back Mode" mask="0x00000004" name="LoopBackMode"/>
          <bitfield caption="Disable Gated Clock" mask="0x00000008" name="DisableGatedClock"/>
          <bitfield caption="Force SuspendM to 1" mask="0x00000010" name="ForceSuspendMTo1"/>
          <bitfield caption="Bypass DPLL" mask="0x00000020" name="ByPassDpll"/>
          <bitfield caption="Host HS Disconnect Disable" mask="0x00000040" name="HostHSDisconnectDisable"/>
          <bitfield caption="Force HS Reset to 50 ms" mask="0x00000080" name="ForceHSRst_50ms"/>
          <bitfield caption="Remove Pull-up When TX" mask="0x00000200" name="RemovePUWhenTX"/>
        </register>
        <register caption="General Finite State Machine Register" name="USBHS_FSM" offset="0x082C" rw="R" size="4">
          <bitfield caption="Dual Role Device State" mask="0x0000000F" name="DRDSTATE" values="USBHS_FSM__DRDSTATE"/>
        </register>
      </register-group>
      <value-group caption="" name="USBHS_DEVCTRL__SPDCONF">
        <value caption="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." name="NORMAL" value="0x0"/>
        <value caption="For a better consumption, if high speed is not needed." name="LOW_POWER" value="0x1"/>
        <value caption="Forced high speed." name="HIGH_SPEED" value="0x2"/>
        <value caption="The peripheral remains in Full-speed mode whatever the host speed capability." name="FORCED_FS" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
